<?php

////////////////////////////////////////////////////////////////////////////////

function antiMat($text) {
//global $text;

$noMat="ќй, простите, пожалуйста, чуть было плохое слово не сказал...";

//«амены отдельных одиноко сто€щих слов

// "хуй"
$text = preg_replace("/\b[’хXx]+[\s_-]*[”уYy]+[\s_-]*[…й]+\b/", "лютик", $text);

// "ебан"
$text = preg_replace("/\b[≈еEe]+[\s_-]*[Ѕб6]+[\s_-]*[јаAa]+[\s_-]*[ЌнH]+\b/", "добрый человек", $text);

// "сука"
$text = preg_replace("/\b[—сCc]+[\s_-]*[”уYy]+[\s_-]*[ кKk]+[\s_-]*[јаAa]+\b/", "милый друг", $text);

// "жопа"
$text = preg_replace("/\b[∆ж]+[\s_-]*[ќоOo0]+[\s_-]*[ѕп]+[\s_-]*[јаAa]+\b/", "попочка", $text);

// "жопу"
$text = preg_replace("/\b[∆ж]+[\s_-]*[ќоOo0]+[\s_-]*[ѕп]+[\s_-]*[”уYy]+\b/", "попочку", $text);

// "пизда"
$text = preg_replace("/\b[ѕп]+[\s_-]*[»иUu]+[\s_-]*[«з3]+[\s_-]*[ƒд]+[\s_-]*[јаAa]+\b/", "ромашка", $text);

//"бл€"
$text = preg_replace("/\b[Ѕб6]+[\s_-]*[Ћл]+[\s_-]*[я€]+\b/", "извините", $text);

//"еб"
$text = preg_replace("/\b[≈еEe®Є]+[\s_-]*[Ѕб6]+\b/", "уважаю", $text);

// "пиздец"
$text = preg_replace("/\b[ѕп]+[\s_-]*[»иUu]+[\s_-]*[«з3]+[\s_-]*[ƒд]+[\s_-]*[≈еEe]+[\s_-]*[÷ц]+\b/", "очень нехорошо", $text);


//ќбщие вхождени€

//≈сли встречаетс€ "бл€д"
if (ereg("[Ѕб6]+[\s_-]*[Ћл]+[\s_-]*[я€]+[\s_-]*[ƒд]+", $text)) return($noMat);

//≈сли встречаетс€ "пизд"
if (ereg("[ѕп]+[\s_-]*[»иUu]+[\s_-]*[«з3]+[\s_-]*[ƒд]+", $text)) return($noMat);

//≈сли встречаетс€ "ебат|н|л|р"
if (ereg("[≈еEe®Є]+[\s_-]*[Ѕб6]+[\s_-]*[јаAa]+[\s_-]*[“тTmЌнHЋл–рPp]+", $text)) return($noMat);

//≈сли встречаетс€ "ебну"
if (ereg("[≈еEe®Є]+[\s_-]*[Ѕб6]+[\s_-]*[ЌнH]+[\s_-]*[”уYy]+", $text)) return($noMat);

//≈сли встречаетс€ "хуй|и|е|ю|€"
if (ereg("[’хXx]+[\s_-]*[”уYy]+[\s_-]*[…й»иUu≈еEe®Єёюя€]+", $text)) return($noMat);

//≈сли встречаетс€ "пид[ао]р"
if (ereg("[ѕп]+[\s_-]*[»иUu]+[\s_-]*[ƒд]+[\s_-]*[јаAaќоOo0]+[\s_-]*[–рPp]+", $text)) return($noMat);


return ($text);

}
////////////////////////////////////////////////////////////////////////////////

function isMat($text) {

//≈сли встречаетс€ "бл€д"
if (ereg("[Ѕб6]+[_ ]*[Ћл]+[_ ]*[я€]+[_ ]*[ƒд]+", $text)) return(true);

//≈сли встречаетс€ "пизд"
if (ereg("[ѕп]+[_ ]*[»иUu]+[_ ]*[«з3]+[_ ]*[ƒд]+", $text)) return(true);

//≈сли встречаетс€ "ебат|н|л|р"
if (ereg("[≈еEe®Є]+[_ ]*[Ѕб6]+[_ ]*[јаAa]+[_ ]*[“тTmЌнHЋл–рPp]+", $text)) return(true);

//≈сли встречаетс€ "ебну"
if (ereg("[≈еEe®Є]+[_ ]*[Ѕб6]+[_ ]*[ЌнH]+[_ ]*[”уYy]+", $text)) return(true);

//≈сли встречаетс€ "хуй|и|е|ю|€"
if (ereg("[’хXx]+[_ ]*[”уYy]+[_ ]*[…й»иUu≈еEe®Єёюя€]+", $text)) return(true);

//≈сли встречаетс€ "пид[ао]р"
if (ereg("[ѕп]+[_ ]*[»иUu]+[_ ]*[ƒд]+[_ ]*[јаAaќоOo0]+[_ ]*[–рPp]+", $text)) return(true);

return false;
}

?>