<?php
//  загрузка таблицы
    se_db_query("DROP TABLE IF EXISTS `emotion_groups`;");

    se_db_query("CREATE TABLE IF NOT EXISTS `emotion_groups` (
`id` int(10) unsigned NOT NULL,
  `img` varchar(50) NOT NULL,
  `img_alt` varchar(50) DEFAULT NULL,
  `title` varchar(50) DEFAULT NULL,
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' ON UPDATE CURRENT_TIMESTAMP,
  `created_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00'
) ENGINE=InnoDB AUTO_INCREMENT=25 DEFAULT CHARSET=utf8;");

    se_db_query("INSERT INTO `emotion_groups` (`id`, `img`, `img_alt`, `title`, `updated_at`, `created_at`) VALUES
(1, 'D83DDE0A.PNG', '8J+Yig==', 'эмоции', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(2, 'D83DDC4D.PNG', '8J+RjQ==', 'жесты', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(3, 'D83DDC28.PNG', '8J+QqA==', 'животные', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(4, 'D83CDF39.PNG', '8J+MuQ==', 'растения', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(5, 'D83CDF4A.PNG', '8J+Nig==', 'еда', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(6, '2708.PNG', '4pyI', 'транспорт', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(7, 'D83DDC55.PNG', '8J+RlQ==', 'одежда', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(8, 'D83CDFC1.PNG', '8J+PgQ==', 'спорт', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(9, 'D83CDFB8.PNG', '8J+OuA==', 'музыка', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(10, 'D83DDC96.PNG', '8J+Slg==', 'любовь', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(11, 'D83CDF82.PNG', '8J+Ogg==', 'праздник', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(12, 'D83DDCBB.PNG', '8J+Suw==', 'техника', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(13, '26D4.PNG', '4puU', 'знаки', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(14, 'D83DDD1F.PNG', '8J+Unw==', 'цифры', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(15, 'D83DDD1D.PNG', '8J+UnQ==', 'стрелки', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(16, '26CE.PNG', '4puO', 'знаки зодиака', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(17, 'D83DDCB0.PNG', '8J+SsA==', 'офис', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(18, 'D83CDDF7D83CDDFA.PNG', '8J+Ht/Cfh7o=', 'флаги', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(19, 'D83DDC6A.PNG', '8J+Rqg==', 'люди', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(20, 'D83CDF0F.PNG', '8J+Mjw==', 'космос', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(21, 'D83CDFE2.PNG', '8J+Pog==', 'здания', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(22, '2614.PNG', '4piU', 'погода', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(23, 'D83CDFAE.PNG', '8J+Org==', 'игры', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(24, 'D83CDF04.PNG', '8J+MhA==', 'картины', '0000-00-00 00:00:00', '0000-00-00 00:00:00');");

    se_db_query("ALTER TABLE `emotion_groups` ADD PRIMARY KEY (`id`);");
    se_db_query("ALTER TABLE `emotion_groups` MODIFY `id` int(10) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=25;");
